doc/abcd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>abcd</title>
<!-- 2019-01-15 Tue 13:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">abcd</h1>
<p>
ABCD is a purely functional, Turing-complete, <a href="http://tunes.org/~iepos/joy.html">concatenative</a> bytecode
with four primitive functions:
</p>

<pre class="example">
[A] [B] a = B [A]
[A] [B] b = [[A] B]
    [A] c = [A] [A]
    [A] d =
</pre>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Rewriting</h2>
<div class="outline-text-2" id="text-1">
<p>
In the equations above, whenever a pattern on the left hand side of an
equality is encountered within a volume of code, it is replaced with
the pattern on the right. Such a replacement is called a <a href="https://en.wikipedia.org/wiki/Rewriting"><i>rewrite</i></a>;
the repeated application of rewrites to a volume of code is called
<i>program rewriting</i>.
</p>

<p>
[Derive these combinators from an analysis of the lambda calculus and
the concept of scope]
</p>

<p>
Program rewriting is different from evaluation in typical
languages. Consider the following JavaScript program:
</p>

<pre class="example">
let frontPage = await HackerNews.titles();
let relevant = frontPage.filter(x =&gt; x.includes("JavaScript"));
let downcase = relevant.map(x =&gt; x.toLowerCase());
console.log(downcase);
</pre>

<p>
In vanilla JavaScript it is not meaningful to talk about serializing
this program after the first line has finished evaluating. It's not
clear how to save the state of a running JavaScript program, and even
if such a mechanism was created (as it was in Dart with "snapshots"),
the result would not be a "JavaScript program". It would be "something
else", some sort of image file that has to be treated differently from
source code.
</p>

<p>
In Denshi it is perfectly possible to serialize a program in the
middle of execution, and the result of the serialization is again a
Denshi program.
</p>

<p>
[Go through the JavaScript program step by step]
</p>

<p>
Because the range of each rewrite is bounded, they can happen in
parallel across a large volume of code.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Dialects</h2>
<div class="outline-text-2" id="text-2">
<p>
This bytecode is simple and universal, serving as a denotational
semantics to define what is computable. To define what is complex
(i.e. to define the spacetime usage of particular patterns), subsets
of this language are identified and given an independent but
compatible operational semantics<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>. These subsets are called
<i>dialects</i> and are a first class notion throughout the Denshi system.
</p>

<p>
Because this arrangement may seem strange from the view of typical
development environments, I want to make an analogy with the UNIX
programming model.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Inference</h2>
<div class="outline-text-2" id="text-3">
<p>
A deep inference presentation of propositional, intuitionistic logic.
</p>

<pre class="example">
                    [A] ⊢ [[A] [A] (∧)]
          [[A] [B] (∧)] ⊢ [A]
          [[A] [B] (∧)] ⊢ [B]
[[[A] [B] (⊃)] [A] (∧)] ⊢ [B]
                    [B] ⊢ [[A] [[B] [A] (∧)] (⊃)]
</pre>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
This technique was used in <a href="http://asmjs.org/">asm.js</a> and more recently the
<a href="https://github.com/ElementsProject/simplicity">Simplicity blockchain language</a>.
</p></div>


</div>
</div></div>
</body>
</html>
